      ******************************************************************
      * AUTHOR: Peter Weston
      * Date: 2021-08-09
      ****************************************************************** 
       IDENTIFICATION DIVISION. 
       PROGRAM-ID. HELLOWORLD.
       DATA DIVISION. 
       FILE SECTION. 
       WORKING-STORAGE SECTION. 
       PROCEDURE DIVISION. *> Start of program
           DISPLAY "Hello world.".
           STOP RUN.
